zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZQ">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0xFC069000"/>
            <parameters>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
        </module>
        <module name="CLASSD" id="11283" version="G">
          <instance name="CLASSD">
            <register-group address-space="base" name="CLASSD" name-in-module="CLASSD" offset="0xFC048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
              <param name="DMAC_ID_TX" value="47"/>
            </parameters>
            <signals>
              <signal pad="PA28" function="F" group="CLASSD_L" index="0"/>
              <signal pad="PA29" function="F" group="CLASSD_L" index="1"/>
              <signal pad="PA30" function="F" group="CLASSD_L" index="2"/>
              <signal pad="PA31" function="F" group="CLASSD_L" index="3"/>
              <signal pad="PB1" function="F" group="CLASSD_R" index="0"/>
              <signal pad="PB2" function="F" group="CLASSD_R" index="1"/>
              <signal pad="PB3" function="F" group="CLASSD_R" index="2"/>
              <signal pad="PB4" function="F" group="CLASSD_R" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="FLEXCOM" id="11268" version="P">
          <instance name="FLEXCOM0">
            <register-group address-space="base" name="FLEXCOM0" name-in-module="FLEXCOM" offset="0xF8034000"/>
            <parameters>
              <param name="INSTANCE_ID" value="19"/>
              <param name="CLOCK_ID" value="19"/>
              <param name="DMAC_ID_TX" value="11"/>
              <param name="DMAC_ID_RX" value="12"/>
              <param name="USART_FIFO_SIZE" value="32"/>
              <param name="SPI_FIFO_SIZE" value="32"/>
              <param name="TWI_FIFO_SIZE" value="16"/>
            </parameters>
            <signals>
              <signal pad="PB28" function="C" group="FLEXCOM0_IO" index="0"/>
              <signal pad="PB29" function="C" group="FLEXCOM0_IO" index="1"/>
              <signal pad="PB30" function="C" group="FLEXCOM0_IO" index="2"/>
              <signal pad="PB31" function="C" group="FLEXCOM0_IO" index="3"/>
              <signal pad="PC0" function="C" group="FLEXCOM0_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM1">
            <register-group address-space="base" name="FLEXCOM1" name-in-module="FLEXCOM" offset="0xF8038000"/>
            <parameters>
              <param name="INSTANCE_ID" value="20"/>
              <param name="CLOCK_ID" value="20"/>
              <param name="DMAC_ID_TX" value="13"/>
              <param name="DMAC_ID_RX" value="14"/>
              <param name="USART_FIFO_SIZE" value="32"/>
              <param name="SPI_FIFO_SIZE" value="32"/>
              <param name="TWI_FIFO_SIZE" value="16"/>
            </parameters>
            <signals>
              <signal pad="PA24" function="A" group="FLEXCOM1_IO" index="0"/>
              <signal pad="PA23" function="A" group="FLEXCOM1_IO" index="1"/>
              <signal pad="PA22" function="A" group="FLEXCOM1_IO" index="2"/>
              <signal pad="PA25" function="A" group="FLEXCOM1_IO" index="3"/>
              <signal pad="PA26" function="A" group="FLEXCOM1_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM2">
            <register-group address-space="base" name="FLEXCOM2" name-in-module="FLEXCOM" offset="0xFC010000"/>
            <parameters>
              <param name="INSTANCE_ID" value="21"/>
              <param name="CLOCK_ID" value="21"/>
              <param name="DMAC_ID_TX" value="15"/>
              <param name="DMAC_ID_RX" value="16"/>
              <param name="USART_FIFO_SIZE" value="32"/>
              <param name="SPI_FIFO_SIZE" value="32"/>
              <param name="TWI_FIFO_SIZE" value="16"/>
            </parameters>
            <signals>
              <signal pad="PA6" function="E" group="FLEXCOM2_IO" index="0"/>
              <signal pad="PD26" function="C" group="FLEXCOM2_IO" index="0"/>
              <signal pad="PA7" function="E" group="FLEXCOM2_IO" index="1"/>
              <signal pad="PD27" function="C" group="FLEXCOM2_IO" index="1"/>
              <signal pad="PA8" function="E" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PD28" function="C" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PA9" function="E" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PD29" function="C" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PA10" function="E" group="FLEXCOM2_IO" index="4"/>
              <signal pad="PD30" function="C" group="FLEXCOM2_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM3">
            <register-group address-space="base" name="FLEXCOM3" name-in-module="FLEXCOM" offset="0xFC014000"/>
            <parameters>
              <param name="INSTANCE_ID" value="22"/>
              <param name="CLOCK_ID" value="22"/>
              <param name="DMAC_ID_TX" value="17"/>
              <param name="DMAC_ID_RX" value="18"/>
              <param name="USART_FIFO_SIZE" value="32"/>
              <param name="SPI_FIFO_SIZE" value="32"/>
              <param name="TWI_FIFO_SIZE" value="16"/>
            </parameters>
            <signals>
              <signal pad="PA15" function="E" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PB23" function="E" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PC20" function="E" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PA13" function="E" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PB22" function="E" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PC19" function="E" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PA14" function="E" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PB21" function="E" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PC18" function="E" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PA16" function="E" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PB24" function="E" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PC21" function="E" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PA17" function="E" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PB25" function="E" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PC22" function="E" group="FLEXCOM3_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM4">
            <register-group address-space="base" name="FLEXCOM4" name-in-module="FLEXCOM" offset="0xFC018000"/>
            <parameters>
              <param name="INSTANCE_ID" value="23"/>
              <param name="CLOCK_ID" value="23"/>
              <param name="DMAC_ID_TX" value="19"/>
              <param name="DMAC_ID_RX" value="20"/>
              <param name="USART_FIFO_SIZE" value="32"/>
              <param name="SPI_FIFO_SIZE" value="32"/>
              <param name="TWI_FIFO_SIZE" value="16"/>
            </parameters>
            <signals>
              <signal pad="PC28" function="B" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PD12" function="B" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PD21" function="C" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PC29" function="B" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PD13" function="B" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PD22" function="C" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PC30" function="B" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PD14" function="B" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PD23" function="C" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PC31" function="B" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PD15" function="B" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PD24" function="C" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PD0" function="B" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PD16" function="B" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PD25" function="C" group="FLEXCOM4_IO" index="4"/>
            </signals>
          </instance>
        </module>
        <module name="GMAC" id="44152" version="2P03">
          <instance name="GMAC">
            <register-group name="GMAC" name-in-module="GMAC" address-space="base" offset="0xF8008000"/>
            <signals>
              <signal group="GTSUCOMP" function="F" pad="PB5" ioset="3"/>
              <signal group="GTXER" function="F" pad="PB6" ioset="3"/>
              <signal group="GRXCK" function="F" pad="PB7" ioset="3"/>
              <signal group="GCRS" function="F" pad="PB8" ioset="3"/>
              <signal group="GCOL" function="F" pad="PB9" ioset="3"/>
              <signal group="GRX" index="2" function="F" pad="PB10" ioset="3"/>
              <signal group="GRX" index="3" function="F" pad="PB11" ioset="3"/>
              <signal group="GTX" index="2" function="F" pad="PB12" ioset="3"/>
              <signal group="GTX" index="3" function="F" pad="PB13" ioset="3"/>
              <signal group="GTXCK" function="F" pad="PB14" ioset="3"/>
              <signal group="GTXEN" function="F" pad="PB15" ioset="3"/>
              <signal group="GRXDV" function="F" pad="PB16" ioset="3"/>
              <signal group="GRXER" function="F" pad="PB17" ioset="3"/>
              <signal group="GRX" index="0" function="F" pad="PB18" ioset="3"/>
              <signal group="GRX" index="1" function="F" pad="PB19" ioset="3"/>
              <signal group="GTX" index="0" function="F" pad="PB20" ioset="3"/>
              <signal group="GTX" index="1" function="F" pad="PB21" ioset="3"/>
              <signal group="GMDC" function="F" pad="PB22" ioset="3"/>
              <signal group="GMDIO" function="F" pad="PB23" ioset="3"/>
              <signal group="GTSUCOMP" function="B" pad="PC9" ioset="1"/>
              <signal group="GTXCK" function="B" pad="PC10" ioset="1"/>
              <signal group="GTXEN" function="B" pad="PC11" ioset="1"/>
              <signal group="GRXDV" function="B" pad="PC12" ioset="1"/>
              <signal group="GRXER" function="B" pad="PC13" ioset="1"/>
              <signal group="GRX" index="0" function="B" pad="PC14" ioset="1"/>
              <signal group="GRX" index="1" function="B" pad="PC15" ioset="1"/>
              <signal group="GTX" index="0" function="B" pad="PC16" ioset="1"/>
              <signal group="GTX" index="1" function="B" pad="PC17" ioset="1"/>
              <signal group="GMDC" function="B" pad="PC18" ioset="1"/>
              <signal group="GMDIO" function="B" pad="PC19" ioset="1"/>
              <signal group="GRXCK" function="B" pad="PC20" ioset="1"/>
              <signal group="GTXER" function="B" pad="PC21" ioset="1"/>
              <signal group="GCRS" function="B" pad="PC22" ioset="1"/>
              <signal group="GCOL" function="B" pad="PC23" ioset="1"/>
              <signal group="GRX" index="2" function="B" pad="PC24" ioset="1"/>
              <signal group="GRX" index="3" function="B" pad="PC25" ioset="1"/>
              <signal group="GTX" index="2" function="B" pad="PC26" ioset="1"/>
              <signal group="GTX" index="3" function="B" pad="PC27" ioset="1"/>
              <signal group="GTSUCOMP" function="D" pad="PD0" ioset="2"/>
              <signal group="GRXCK" function="D" pad="PD1" ioset="2"/>
              <signal group="GTXER" function="D" pad="PD2" ioset="2"/>
              <signal group="GCRS" function="D" pad="PD3" ioset="2"/>
              <signal group="GCOL" function="D" pad="PD4" ioset="2"/>
              <signal group="GRX" index="2" function="D" pad="PD5" ioset="2"/>
              <signal group="GRX" index="3" function="D" pad="PD6" ioset="2"/>
              <signal group="GTX" index="2" function="D" pad="PD7" ioset="2"/>
              <signal group="GTX" index="3" function="D" pad="PD8" ioset="2"/>
              <signal group="GTXCK" function="D" pad="PD9" ioset="2"/>
              <signal group="GTXEN" function="D" pad="PD10" ioset="2"/>
              <signal group="GRXDV" function="D" pad="PD11" ioset="2"/>
              <signal group="GRXER" function="D" pad="PD12" ioset="2"/>
              <signal group="GRX" index="0" function="D" pad="PD13" ioset="2"/>
              <signal group="GRX" index="1" function="D" pad="PD14" ioset="2"/>
              <signal group="GTX" index="0" function="D" pad="PD15" ioset="2"/>
              <signal group="GTX" index="1" function="D" pad="PD16" ioset="2"/>
              <signal group="GMDC" function="D" pad="PD17" ioset="2"/>
              <signal group="GMDIO" function="D" pad="PD18" ioset="2"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="5" caption="Ethernet MAC"/>
              <param name="CLOCK_ID" value="5"/>
              <param name="INSTANCE_ID_Q1" value="66" caption="GMAC Queue 1 Interrupt"/>
              <param name="INSTANCE_ID_Q2" value="67" caption="GMAC Queue 2 Interrupt"/>
            </parameters>
          </instance>
        </module>
        <module name="I2SC" id="11241" version="N">
          <instance name="I2SC0">
            <register-group address-space="base" name="I2SC0" name-in-module="I2SC" offset="0xF8050000"/>
            <parameters>
              <param name="INSTANCE_ID" value="54"/>
              <param name="CLOCK_ID" value="54"/>
              <param name="DMAC_ID_TX" value="31"/>
              <param name="DMAC_ID_RX" value="32"/>
            </parameters>
            <signals>
              <signal pad="PC1" function="E" group="I2SC0_CK"/>
              <signal pad="PD19" function="E" group="I2SC0_CK"/>
              <signal pad="PC4" function="E" group="I2SC0_DI" index="0"/>
              <signal pad="PD22" function="E" group="I2SC0_DI" index="0"/>
              <signal pad="PC5" function="E" group="I2SC0_DO" index="0"/>
              <signal pad="PD23" function="E" group="I2SC0_DO" index="0"/>
              <signal pad="PC2" function="E" group="I2SC0_MCK"/>
              <signal pad="PD20" function="E" group="I2SC0_MCK"/>
              <signal pad="PC3" function="E" group="I2SC0_WS"/>
              <signal pad="PD21" function="E" group="I2SC0_WS"/>
            </signals>
          </instance>
          <instance name="I2SC1">
            <register-group address-space="base" name="I2SC1" name-in-module="I2SC" offset="0xFC04C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="55"/>
              <param name="CLOCK_ID" value="55"/>
              <param name="DMAC_ID_TX" value="33"/>
              <param name="DMAC_ID_RX" value="34"/>
            </parameters>
            <signals>
              <signal pad="PA15" function="D" group="I2SC1_CK"/>
              <signal pad="PB15" function="D" group="I2SC1_CK"/>
              <signal pad="PA17" function="D" group="I2SC1_DI" index="0"/>
              <signal pad="PB17" function="D" group="I2SC1_DI" index="0"/>
              <signal pad="PA18" function="D" group="I2SC1_DO" index="0"/>
              <signal pad="PB18" function="D" group="I2SC1_DO" index="0"/>
              <signal pad="PA14" function="D" group="I2SC1_MCK"/>
              <signal pad="PB14" function="D" group="I2SC1_MCK"/>
              <signal pad="PA16" function="D" group="I2SC1_WS"/>
              <signal pad="PB16" function="D" group="I2SC1_WS"/>
            </signals>
          </instance>
        </module>
