zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
        <register caption="Correction Values Register" name="ADC_CVR" offset="0xD4" rw="RW" size="4">
          <bitfield caption="Offset Correction" mask="0x0000FFFF" name="OFFSETCORR"/>
          <bitfield caption="Gain Correction" mask="0xFFFF0000" name="GAINCORR"/>
        </register>
        <register caption="Channel Error Correction Register" name="ADC_CECR" offset="0xD8" rw="RW" size="4">
          <bitfield caption="Error Correction Enable for channel 0" mask="0x00000001" name="ECORR0"/>
          <bitfield caption="Error Correction Enable for channel 1" mask="0x00000002" name="ECORR1"/>
          <bitfield caption="Error Correction Enable for channel 2" mask="0x00000004" name="ECORR2"/>
          <bitfield caption="Error Correction Enable for channel 3" mask="0x00000008" name="ECORR3"/>
          <bitfield caption="Error Correction Enable for channel 4" mask="0x00000010" name="ECORR4"/>
          <bitfield caption="Error Correction Enable for channel 5" mask="0x00000020" name="ECORR5"/>
          <bitfield caption="Error Correction Enable for channel 6" mask="0x00000040" name="ECORR6"/>
          <bitfield caption="Error Correction Enable for channel 7" mask="0x00000080" name="ECORR7"/>
          <bitfield caption="Error Correction Enable for channel 8" mask="0x00000100" name="ECORR8"/>
          <bitfield caption="Error Correction Enable for channel 9" mask="0x00000200" name="ECORR9"/>
          <bitfield caption="Error Correction Enable for channel 10" mask="0x00000400" name="ECORR10"/>
          <bitfield caption="Error Correction Enable for channel 11" mask="0x00000800" name="ECORR11"/>
        </register>
        <register caption="Touchscreen Correction Values Register" name="ADC_TSCVR" offset="0xDC" rw="RW" size="4">
          <bitfield caption="Touchscreen Offset Correction" mask="0x0000FFFF" name="TSOFFSETCORR"/>
          <bitfield caption="Touchscreen Gain Correction" mask="0xFFFF0000" name="TSGAINCORR"/>
        </register>
        <register caption="Write Protection Mode Register" name="ADC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ADC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ADC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Trigger Selection" name="ADC_MR__TRGSEL">
        <value caption="ADTRG" name="ADC_TRIG0" value="0x0"/>
        <value caption="TIOA0" name="ADC_TRIG1" value="0x1"/>
        <value caption="TIOA1" name="ADC_TRIG2" value="0x2"/>
        <value caption="TIOA2" name="ADC_TRIG3" value="0x3"/>
        <value caption="PWM event line 0" name="ADC_TRIG4" value="0x4"/>
        <value caption="PWM event line 1" name="ADC_TRIG5" value="0x5"/>
        <value caption="TIOA3" name="ADC_TRIG6" value="0x6"/>
        <value caption="RTCOUT0" name="ADC_TRIG7" value="0x7"/>
      </value-group>
      <value-group caption="Sleep Mode" name="ADC_MR__SLEEP">
        <value caption="Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions." name="NORMAL" value="0"/>
        <value caption="Sleep Mode: The wakeup time can be modified by programming the FWUP bit." name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="Fast Wakeup" name="ADC_MR__FWUP">
        <value caption="If SLEEP is 1, then both ADC core and reference voltage circuitry are OFF between conversions" name="OFF" value="0"/>
        <value caption="If SLEEP is 1, then Fast Wakeup Sleep mode: The voltage reference is ON between conversions and ADC core is OFF" name="ON" value="1"/>
      </value-group>
      <value-group caption="Startup Time" name="ADC_MR__STARTUP">
        <value caption="0 periods of ADCCLK" name="SUT0" value="0x0"/>
        <value caption="8 periods of ADCCLK" name="SUT8" value="0x1"/>
        <value caption="16 periods of ADCCLK" name="SUT16" value="0x2"/>
        <value caption="24 periods of ADCCLK" name="SUT24" value="0x3"/>
        <value caption="64 periods of ADCCLK" name="SUT64" value="0x4"/>
        <value caption="80 periods of ADCCLK" name="SUT80" value="0x5"/>
        <value caption="96 periods of ADCCLK" name="SUT96" value="0x6"/>
        <value caption="112 periods of ADCCLK" name="SUT112" value="0x7"/>
        <value caption="512 periods of ADCCLK" name="SUT512" value="0x8"/>
        <value caption="576 periods of ADCCLK" name="SUT576" value="0x9"/>
        <value caption="640 periods of ADCCLK" name="SUT640" value="0xA"/>
        <value caption="704 periods of ADCCLK" name="SUT704" value="0xB"/>
        <value caption="768 periods of ADCCLK" name="SUT768" value="0xC"/>
        <value caption="832 periods of ADCCLK" name="SUT832" value="0xD"/>
        <value caption="896 periods of ADCCLK" name="SUT896" value="0xE"/>
        <value caption="960 periods of ADCCLK" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="Analog Change" name="ADC_MR__ANACH">
        <value caption="No analog change on channel switching: DIFF0 is used for all channels." name="NONE" value="0"/>
        <value caption="Allows different analog settings for each channel. See ADC Channel Offset RegisterChannel Configuration Register." name="ALLOWED" value="1"/>
      </value-group>
      <value-group caption="Use Sequence Enable" name="ADC_MR__USEQ">
        <value caption="Normal mode: The controller converts channels in a simple numeric order depending only on the channel index." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence mode: The sequence respects what is defined in ADC_SEQR1 and ADC_SEQR2 registers and can be used to convert the same channel several times." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="Last Channel Comparison Mode" name="ADC_LCTMR__CMPMOD">
        <value caption="Generates the LCCHG flag in ADC_ISR when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates the LCCHG flag in ADC_ISR when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates the LCCHG flag in ADC_ISR when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates the LCCHG flag in ADC_ISR when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="Comparison Mode" name="ADC_EMR__CMPMODE">
        <value caption="When the converted data is lower than the low threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode." name="LOW" value="0x0"/>
        <value caption="When the converted data is higher than the high threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode." name="HIGH" value="0x1"/>
        <value caption="When the converted data is in the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode." name="IN" value="0x2"/>
        <value caption="When the converted data is out of the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="Comparison Type" name="ADC_EMR__CMPTYPE">
        <value caption="Any conversion is performed and comparison function drives the COMPE flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison conditions must be met to start the storage of all conversions until the CMPRST bit is set." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="Over Sampling Rate" name="ADC_EMR__OSR">
        <value caption="No averaging. ADC sample rate is maximum." name="NO_AVERAGE" value="0x0"/>
        <value caption="1-bit enhanced resolution by averaging. ADC sample rate divided by 4." name="OSR4" value="0x1"/>
        <value caption="2-bit enhanced resolution by averaging. ADC sample rate divided by 16." name="OSR16" value="0x2"/>
      </value-group>
      <value-group caption="Averaging on Single Trigger Event" name="ADC_EMR__ASTE">
        <value caption="The average requests several trigger events." name="MULTI_TRIG_AVERAGE" value="0"/>
        <value caption="The average requests only one trigger event." name="SINGLE_TRIG_AVERAGE" value="1"/>
      </value-group>
