zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
      <value-group caption="Bit Rate Source Clock" name="FLEX_SPI_MR__BRSRCCLK">
        <value caption="The peripheral clock is the source clock for the bit rate generation." name="PERIPH_CLK" value="0"/>
        <value caption="GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Comparison Mode" name="FLEX_SPI_MR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception of all incoming characters until REQCLR is set." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="Bits Per Transfer" name="FLEX_SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="Transmit Data Register Empty Mode" name="FLEX_SPI_FMR__TXRDYM">
        <value caption="TDRE will be at level '1' when at least one data can be written in the Transmit FIFO." name="ONE_DATA" value="0"/>
        <value caption="TDRE will be at level '1' when at least two data can be written in the Transmit FIFO.Cannot be used if FLEX_SPI_MR.PS =1." name="TWO_DATA" value="1"/>
      </value-group>
      <value-group caption="Receive Data Register Full Mode" name="FLEX_SPI_FMR__RXRDYM">
        <value caption="RDRF will be at level '1' when at least one unread data is in the Receive FIFO." name="ONE_DATA" value="0x0"/>
        <value caption="RDRF will be at level '1' when at least two unread data are in the Receive FIFO.Cannot be used if FLEX_SPI_MR.PS =1." name="TWO_DATA" value="0x1"/>
        <value caption="RDRF will be at level '1' when at least four unread data are in the Receive FIFO.Cannot be used when FLEX_SPI_CSRx.BITS is greater than 0, or if FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1." name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="FLEX_SPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0" name="PASSWD" value="0x535049"/>
      </value-group>
      <value-group name="FLEX_SPI_WPMR__WPITEN">
        <value name="0" caption="Disables the write protection on interrupt registers if WPKEY corresponds to 0x535049 (SPI in ASCII)." value="0"/>
        <value name="1" caption="Enables the write protection on interrupt registers if WPKEY corresponds to 0x535049 (SPI in ASCII)." value="1"/>
      </value-group>
      <value-group name="FLEX_SPI_WPMR__WPCREN">
        <value name="0" caption="Disables the write protection on control register if WPKEY corresponds to 0x535049 (&quot;SPI&quot; in ASCII)." value="0"/>
        <value name="1" caption="Enables the write protection on control register if WPKEY corresponds to 0x535049 (&quot;SPI&quot; in ASCII)." value="1"/>
      </value-group>
      <value-group caption="Internal Device Address Size" name="FLEX_TWI_MMR__IADRSZ">
        <value caption="No internal device address" name="NONE" value="0x0"/>
        <value caption="One-byte internal device address" name="1_BYTE" value="0x1"/>
        <value caption="Two-byte internal device address" name="2_BYTE" value="0x2"/>
        <value caption="Three-byte internal device address" name="3_BYTE" value="0x3"/>
      </value-group>
      <value-group name="FLEX_TWI_MMR__NOAP">
        <value name="0" caption="A stop condition is sent automatically upon Not-Acknowledge error detection." value="0"/>
        <value name="1" caption="No automatic action is performed upon Not-Acknowledge error detection." value="1"/>
      </value-group>
      <value-group caption="Bit Rate Source Clock" name="FLEX_TWI_CWGR__BRSRCCLK">
        <value caption="The peripheral clock is the source clock for the bit rate generation." name="PERIPH_CLK" value="0"/>
        <value caption="GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Transmitter Ready Mode" name="FLEX_TWI_FMR__TXRDYM">
        <value caption="TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO" name="ONE_DATA" value="0x0"/>
        <value caption="TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO" name="TWO_DATA" value="0x1"/>
        <value caption="TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO" name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Receiver Ready Mode" name="FLEX_TWI_FMR__RXRDYM">
        <value caption="RXRDY will be at level '1' when at least one unread data is in the Receive FIFO" name="ONE_DATA" value="0x0"/>
        <value caption="RXRDY will be at level '1' when at least two unread data are in the Receive FIFO" name="TWO_DATA" value="0x1"/>
        <value caption="RXRDY will be at level '1' when at least four unread data are in the Receive FIFO" name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="FLEX_TWI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0" name="PASSWD" value="0x545749"/>
      </value-group>
      <value-group name="FLEX_TWI_WPMR__WPITEN">
        <value name="0" caption="Disables the write protection on interrupt registers if WPKEY corresponds to 0x545749 (TWI in ASCII)." value="0"/>
        <value name="1" caption="Enables the write protection on interrupt registers if WPKEY corresponds to 0x545749 (TWI in ASCII)." value="1"/>
      </value-group>
      <value-group name="FLEX_TWI_WPMR__WPCREN">
        <value name="0" caption="Disables the write protection on control register if WPKEY corresponds to 0x545749 (TWI in ASCII)." value="0"/>
        <value name="1" caption="Enables the write protection on control register if WPKEY corresponds to 0x545749 (TWI in ASCII)." value="1"/>
      </value-group>
    </module>
    <module name="GMAC" id="44152" version="2P03" caption="Gigabit Ethernet MAC">
      <register-group name="GMAC_SA" size="8">
        <register caption="Specific Address 1 Bottom Register" name="GMAC_SAB" offset="0x00" rw="RW" size="4">
          <bitfield caption="Specific Address 1" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Top Register" name="GMAC_SAT" offset="0x04" rw="RW" size="4">
          <bitfield name="ADDR" caption="Specific Address 2" mask="0xFFFF"/>
          <bitfield name="FILTSORD" caption="Filter Source or Destination MAC Address" mask="0x10000" values="GMAC_SAT__FILTSORD"/>
          <bitfield name="FILTBMASK" caption="Filter Bytes Mask" mask="0x3F000000" values="GMAC_SAT__FILTBMASK"/>
        </register>
      </register-group>
