zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
      <register-group name="GMAC_ST2CW" size="0x08">
        <register name="GMAC_ST2CW0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Screening Type 2 Compare Word 0 Register ">
          <bitfield name="MASKVAL" caption="Mask Value" mask="0xFFFF"/>
          <bitfield name="COMPVAL" caption="Compare Value" mask="0xFFFF0000"/>
        </register>
        <register name="GMAC_ST2CW1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Screening Type 2 Compare Word 1 Register ">
          <bitfield name="OFFSVAL" caption="Offset Value in Bytes" mask="0x7F"/>
          <bitfield name="OFFSSTRT" caption="Ethernet Frame Offset Start" mask="0x180" values="GMAC_ST2CW1R__OFFSSTRT"/>
          <bitfield name="DISMASK" caption="Disable Mask" mask="0x200" values="GMAC_ST2CW1R__DISMASK"/>
        </register>
      </register-group>
      <register-group name="GMAC" caption="Gigabit Ethernet MAC">
        <register name="GMAC_NCR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Network Control Register">
          <bitfield name="LBL" caption="Loop Back Local" mask="0x2" values="GMAC_NCR__LBL"/>
          <bitfield name="RXEN" caption="Receive Enable" mask="0x4" values="GMAC_NCR__RXEN"/>
          <bitfield name="TXEN" caption="Transmit Enable" mask="0x8" values="GMAC_NCR__TXEN"/>
          <bitfield name="MPE" caption="Management Port Enable" mask="0x10" values="GMAC_NCR__MPE"/>
          <bitfield name="CLRSTAT" caption="Clear Statistics Registers (Write-only)" mask="0x20" values="GMAC_NCR__CLRSTAT"/>
          <bitfield name="INCSTAT" caption="Increment Statistics Registers (Write-only)" mask="0x40"/>
          <bitfield name="WESTAT" caption="Write Enable for Statistics Registers" mask="0x80" values="GMAC_NCR__WESTAT"/>
          <bitfield name="BP" caption="Back Pressure" mask="0x100" values="GMAC_NCR__BP"/>
          <bitfield name="TSTART" caption="Start Transmission (Write-only)" mask="0x200" values="GMAC_NCR__TSTART"/>
          <bitfield name="THALT" caption="Transmit Halt (Write-only)" mask="0x400" values="GMAC_NCR__THALT"/>
          <bitfield name="TXPF" caption="Transmit Pause Frame (Write-only)" mask="0x800" values="GMAC_NCR__TXPF"/>
          <bitfield name="TXZQPF" caption="Transmit Zero Quantum Pause Frame (Write-only)" mask="0x1000" values="GMAC_NCR__TXZQPF"/>
          <bitfield name="SRTSM" caption="Store Receive Timestamp to Memory" mask="0x8000" values="GMAC_NCR__SRTSM"/>
          <bitfield name="ENPBPR" caption="Enable PFC Priority-based Pause Reception" mask="0x10000"/>
          <bitfield name="TXPBPF" caption="Transmit PFC Priority-based Pause Frame" mask="0x20000" values="GMAC_NCR__TXPBPF"/>
          <bitfield name="FNP" caption="Flush Next Packet" mask="0x40000" values="GMAC_NCR__FNP"/>
          <bitfield name="TXLPIEN" caption="Enable LPI Transmission" mask="0x80000"/>
          <bitfield name="PTPUNIENA" caption="Detection of Unicast PTP Frames Enable" mask="0x100000" values="GMAC_NCR__PTPUNIENA"/>
          <bitfield name="STUDPOFFSET" caption="Store UDP Offset" mask="0x400000" values="GMAC_NCR__STUDPOFFSET"/>
          <bitfield name="OSSMODE" caption="One Step Sync Mode" mask="0x1000000" values="GMAC_NCR__OSSMODE"/>
          <bitfield name="PFCCTL" caption="Multiple PFC Pause quantum Enable" mask="0x2000000" values="GMAC_NCR__PFCCTL"/>
          <bitfield name="EXTSELRQEN" caption="External Selection of Receive Queue Enable" mask="0x4000000" values="GMAC_NCR__EXTSELRQEN"/>
          <bitfield name="OSSCORR" caption="OSS Correction Field" mask="0x8000000"/>
          <bitfield name="MIIONRGMII" caption="MII Control" mask="0x10000000" values="GMAC_NCR__MIIONRGMII"/>
          <bitfield name="IFGQAVCRED" caption="Credit-Based Shaping Algorithm Modification" mask="0x40000000" values="GMAC_NCR__IFGQAVCRED"/>
        </register>
        <register name="GMAC_NCFGR" offset="0x4" rw="RW" size="4" initval="0x00080000" caption="Network Configuration Register">
          <bitfield name="SPD" caption="Speed" mask="0x1"/>
          <bitfield name="FD" caption="Full Duplex" mask="0x2"/>
          <bitfield name="DNVLAN" caption="Discard Non-VLAN FRAMES" mask="0x4"/>
          <bitfield name="JFRAME" caption="Jumbo Frame Size" mask="0x8"/>
          <bitfield name="CAF" caption="Copy All Frames" mask="0x10"/>
          <bitfield name="NBC" caption="No Broadcast" mask="0x20"/>
          <bitfield name="MTIHEN" caption="Multicast Hash Enable" mask="0x40"/>
          <bitfield name="UNIHEN" caption="Unicast Hash Enable" mask="0x80"/>
          <bitfield name="MAXFS" caption="1536 Maximum Frame Size" mask="0x100"/>
          <bitfield name="RTY" caption="Retry Test0" mask="0x1000"/>
          <bitfield name="PEN" caption="Pause Enable" mask="0x2000"/>
          <bitfield name="RXBUFO" caption="Receive Buffer Offset" mask="0xC000"/>
          <bitfield name="LFERD" caption="Length Field Error Frame Discard" mask="0x10000"/>
          <bitfield name="RFCS" caption="Remove FCS" mask="0x20000"/>
          <bitfield name="CLK" caption="MDC CLock Division" mask="0x1C0000" values="GMAC_NCFGR__CLK"/>
          <bitfield name="DBW" caption="Data Bus Width" mask="0x600000"/>
          <bitfield name="DCPF" caption="Disable Copy of Pause Frames" mask="0x800000"/>
          <bitfield name="RXCOEN" caption="Receive Checksum Offload Enable" mask="0x1000000"/>
          <bitfield name="EFRHD" caption="Enable Frames Received in Half Duplex" mask="0x2000000"/>
          <bitfield name="IRXFCS" caption="Ignore RX FCS" mask="0x4000000"/>
          <bitfield name="IPGSEN" caption="IP Stretch Enable" mask="0x10000000"/>
          <bitfield name="RXBP" caption="Receive Bad Preamble" mask="0x20000000"/>
          <bitfield name="IRXER" caption="Ignore Receive Error from PHY" mask="0x40000000"/>
        </register>
        <register name="GMAC_NSR" offset="0x8" rw="R" size="4" caption="Network Status Register">
          <bitfield name="MDIO" caption="MDIO Input Status" mask="0x2"/>
          <bitfield name="IDLE" caption="PHY Management Logic Idle" mask="0x4"/>
          <bitfield name="PFCPAUSN" caption="PFC Pause Negotiated" mask="0x40"/>
          <bitfield name="RXLPIS" caption="LPI Indication" mask="0x80"/>
        </register>
        <register name="GMAC_UR" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="User Register">
          <bitfield name="RMII" caption="Reduced MII Mode" mask="0x1" values="GMAC_UR__RMII"/>
          <bitfield name="HDFLCTLEN" caption="Half Duplex Flow Control Enable" mask="0x40" values="GMAC_UR__HDFLCTLEN"/>
        </register>
