zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
        <register name="GMAC_TXUDAR" offset="0xD8" rw="RW" size="4" initval="0x00000000" caption="PTP TX Unicast IP Destination Address Register">
          <bitfield name="TXUDA" caption="Transmit Unicast Destination Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_NSC" offset="0xDC" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Nanosecond Comparison Register">
          <bitfield name="NANOSEC" caption="1588 Timer Nanosecond Comparison Value" mask="0x3FFFFF"/>
        </register>
        <register name="GMAC_SCL" offset="0xE0" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Second Comparison Low Register">
          <bitfield name="SEC" caption="1588 Timer Second Comparison Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_SCH" offset="0xE4" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Second Comparison High Register">
          <bitfield name="SEC" caption="1588 Timer Second Comparison Value" mask="0xFFFF"/>
        </register>
        <register name="GMAC_EFTSH" offset="0xE8" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="GMAC_EFRSH" offset="0xEC" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Received Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="GMAC_PEFTSH" offset="0xF0" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="GMAC_PEFRSH" offset="0xF4" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="GMAC_OTLO" offset="0x100" rw="R" size="4" initval="0x00000000" caption="Octets Transmitted Low Register">
          <bitfield name="TXO" caption="Transmitted Octets" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_OTHI" offset="0x104" rw="R" size="4" initval="0x00000000" caption="Octets Transmitted High Register">
          <bitfield name="TXO" caption="Transmitted Octets" mask="0xFFFF"/>
        </register>
        <register name="GMAC_FT" offset="0x108" rw="R" size="4" initval="0x00000000" caption="Frames Transmitted Register">
          <bitfield name="FTX" caption="Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_BCFT" offset="0x10C" rw="R" size="4" initval="0x00000000" caption="Broadcast Frames Transmitted Register">
          <bitfield name="BFTX" caption="Broadcast Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_MFT" offset="0x110" rw="R" size="4" initval="0x00000000" caption="Multicast Frames Transmitted Register">
          <bitfield name="MFTX" caption="Multicast Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_PFT" offset="0x114" rw="R" size="4" initval="0x00000000" caption="Pause Frames Transmitted Register">
          <bitfield name="PFTX" caption="Pause Frames Transmitted Register" mask="0xFFFF"/>
        </register>
        <register name="GMAC_BFT64" offset="0x118" rw="R" size="4" initval="0x00000000" caption="64 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="64 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFT127" offset="0x11C" rw="R" size="4" initval="0x00000000" caption="65 to 127 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="65 to 127 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFT255" offset="0x120" rw="R" size="4" initval="0x00000000" caption="128 to 255 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="128 to 255 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFT511" offset="0x124" rw="R" size="4" initval="0x00000000" caption="256 to 511 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="256 to 511 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFT1023" offset="0x128" rw="R" size="4" initval="0x00000000" caption="512 to 1023 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="512 to 1023 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFT1518" offset="0x12C" rw="R" size="4" initval="0x00000000" caption="1024 to 1518 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="1024 to 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_GTBFT1518" offset="0x130" rw="R" size="4" initval="0x00000000" caption="Greater Than 1518 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="Greater than 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TUR" offset="0x134" rw="R" size="4" initval="0x00000000" caption="Transmit Underruns Register">
          <bitfield name="TXUNR" caption="Transmit Underruns" mask="0x3FF"/>
        </register>
        <register name="GMAC_SCF" offset="0x138" rw="R" size="4" initval="0x00000000" caption="Single Collision Frames Register">
          <bitfield name="SCOL" caption="Single Collision" mask="0x3FFFF"/>
        </register>
        <register name="GMAC_MCF" offset="0x13C" rw="R" size="4" initval="0x00000000" caption="Multiple Collision Frames Register">
          <bitfield name="MCOL" caption="Multiple Collision" mask="0x3FFFF"/>
        </register>
        <register name="GMAC_EC" offset="0x140" rw="R" size="4" initval="0x00000000" caption="Excessive Collisions Register">
          <bitfield name="XCOL" caption="Excessive Collisions" mask="0x3FF"/>
        </register>
        <register name="GMAC_LC" offset="0x144" rw="R" size="4" initval="0x00000000" caption="Late Collisions Register">
          <bitfield name="LCOL" caption="Late Collisions" mask="0x3FF"/>
        </register>
