zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
        <register name="GMAC_DTF" offset="0x148" rw="R" size="4" initval="0x00000000" caption="Deferred Transmission Frames Register">
          <bitfield name="DEFT" caption="Deferred Transmission" mask="0x3FFFF"/>
        </register>
        <register name="GMAC_CSE" offset="0x14C" rw="R" size="4" initval="0x00000000" caption="Carrier Sense Errors Register">
          <bitfield name="CSR" caption="Carrier Sense Error" mask="0x3FF"/>
        </register>
        <register name="GMAC_ORLO" offset="0x150" rw="R" size="4" initval="0x00000000" caption="Octets Received Low Received Register">
          <bitfield name="RXO" caption="Received Octets" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_ORHI" offset="0x154" rw="R" size="4" initval="0x00000000" caption="Octets Received High Received Register">
          <bitfield name="RXO" caption="Received Octets" mask="0xFFFF"/>
        </register>
        <register name="GMAC_FR" offset="0x158" rw="R" size="4" initval="0x00000000" caption="Frames Received Register">
          <bitfield name="FRX" caption="Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_BCFR" offset="0x15C" rw="R" size="4" initval="0x00000000" caption="Broadcast Frames Received Register">
          <bitfield name="BFRX" caption="Broadcast Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_MFR" offset="0x160" rw="R" size="4" initval="0x00000000" caption="Multicast Frames Received Register">
          <bitfield name="MFRX" caption="Multicast Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_PFR" offset="0x164" rw="R" size="4" initval="0x00000000" caption="Pause Frames Received Register">
          <bitfield name="PFRX" caption="Pause Frames Received Register" mask="0xFFFF"/>
        </register>
        <register name="GMAC_BFR64" offset="0x168" rw="R" size="4" initval="0x00000000" caption="64 Byte Frames Received Register">
          <bitfield name="NFRX" caption="64 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFR127" offset="0x16C" rw="R" size="4" initval="0x00000000" caption="65 to 127 Byte Frames Received Register">
          <bitfield name="NFRX" caption="65 to 127 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFR255" offset="0x170" rw="R" size="4" initval="0x00000000" caption="128 to 255 Byte Frames Received Register">
          <bitfield name="NFRX" caption="128 to 255 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFR511" offset="0x174" rw="R" size="4" initval="0x00000000" caption="256 to 511 Byte Frames Received Register">
          <bitfield name="NFRX" caption="256 to 511 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFR1023" offset="0x178" rw="R" size="4" initval="0x00000000" caption="512 to 1023 Byte Frames Received Register">
          <bitfield name="NFRX" caption="512 to 1023 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TBFR1518" offset="0x17C" rw="R" size="4" initval="0x00000000" caption="1024 to 1518 Byte Frames Received Register">
          <bitfield name="NFRX" caption="1024 to 1518 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TMXBFR" offset="0x180" rw="R" size="4" initval="0x00000000" caption="1519 to Maximum Byte Frames Received Register">
          <bitfield name="NFRX" caption="1519 to Maximum Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_UFR" offset="0x184" rw="R" size="4" initval="0x00000000" caption="Undersize Frames Received Register">
          <bitfield name="UFRX" caption="Undersize Frames Received" mask="0x3FF"/>
        </register>
        <register name="GMAC_OFR" offset="0x188" rw="R" size="4" initval="0x00000000" caption="Oversize Frames Received Register">
          <bitfield name="OFRX" caption="Oversized Frames Received" mask="0x3FF"/>
        </register>
        <register name="GMAC_JR" offset="0x18C" rw="R" size="4" initval="0x00000000" caption="Jabbers Received Register">
          <bitfield name="JRX" caption="Jabbers Received" mask="0x3FF"/>
        </register>
        <register name="GMAC_FCSE" offset="0x190" rw="R" size="4" initval="0x00000000" caption="Frame Check Sequence Errors Register">
          <bitfield name="FCKR" caption="Frame Check Sequence Errors" mask="0x3FF"/>
        </register>
        <register name="GMAC_LFFE" offset="0x194" rw="R" size="4" initval="0x00000000" caption="Length Field Frame Errors Register">
          <bitfield name="LFER" caption="Length Field Frame Errors" mask="0x3FF"/>
        </register>
        <register name="GMAC_RSE" offset="0x198" rw="R" size="4" initval="0x00000000" caption="Receive Symbol Errors Register">
          <bitfield name="RXSE" caption="Receive Symbol Errors" mask="0x3FF"/>
        </register>
        <register name="GMAC_AE" offset="0x19C" rw="R" size="4" initval="0x00000000" caption="Alignment Errors Register">
          <bitfield name="AER" caption="Alignment Errors" mask="0x3FF"/>
        </register>
        <register name="GMAC_RRE" offset="0x1A0" rw="R" size="4" initval="0x00000000" caption="Receive Resource Errors Register">
          <bitfield name="RXRER" caption="Receive Resource Errors" mask="0x3FFFF"/>
        </register>
        <register name="GMAC_ROE" offset="0x1A4" rw="R" size="4" initval="0x00000000" caption="Receive Overrun Register">
          <bitfield name="RXOVR" caption="Receive Overruns" mask="0x3FF"/>
        </register>
        <register name="GMAC_IHCE" offset="0x1A8" rw="R" size="4" initval="0x00000000" caption="IP Header Checksum Errors Register">
          <bitfield name="HCKER" caption="IP Header Checksum Errors" mask="0xFF"/>
        </register>
        <register name="GMAC_TCE" offset="0x1AC" rw="R" size="4" initval="0x00000000" caption="TCP Checksum Errors Register">
          <bitfield name="TCKER" caption="TCP Checksum Errors" mask="0xFF"/>
        </register>
        <register name="GMAC_UCE" offset="0x1B0" rw="R" size="4" initval="0x00000000" caption="UDP Checksum Errors Register">
          <bitfield name="UCKER" caption="UDP Checksum Errors" mask="0xFF"/>
        </register>
