zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
        <register name="GMAC_FLRXPCR" offset="0x1B4" rw="R" size="4" initval="0x00000000" caption="Flushed Received Packets Counter Register">
          <bitfield name="COUNT" caption="Flushed Received Packets Count (cleared on read)" mask="0xFFFF"/>
        </register>
        <register name="GMAC_TISUBN" offset="0x1BC" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Increment Sub-nanoseconds Register">
          <bitfield name="MSBTIR" caption="Most Significant Bits of Timer Increment Register" mask="0xFFFF"/>
          <bitfield name="LSBTIR" caption="Lower Significant Bits of Timer Increment Register" mask="0xFF000000"/>
        </register>
        <register name="GMAC_TSH" offset="0x1C0" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Seconds High Register">
          <bitfield name="TCS" caption="Timer Count in Seconds" mask="0xFFFF"/>
        </register>
        <register name="GMAC_TSL" offset="0x1D0" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Seconds Low Register">
          <bitfield name="TCS" caption="Timer Count in Seconds" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TN" offset="0x1D4" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Nanoseconds Register">
          <bitfield name="TNS" caption="Timer Count in Nanoseconds" mask="0x3FFFFFFF"/>
        </register>
        <register name="GMAC_TA" offset="0x1D8" rw="W" size="4" caption="1588 Timer Adjust Register">
          <bitfield name="ITDT" caption="Increment/Decrement" mask="0x3FFFFFFF"/>
          <bitfield name="ADJ" caption="Adjust 1588 Timer" mask="0x80000000"/>
        </register>
        <register name="GMAC_TI" offset="0x1DC" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Increment Register">
          <bitfield name="CNS" caption="Count Nanoseconds" mask="0xFF"/>
          <bitfield name="ACNS" caption="Alternative Count Nanoseconds" mask="0xFF00"/>
          <bitfield name="NIT" caption="Number of Increments" mask="0xFF0000"/>
        </register>
        <register name="GMAC_EFTSL" offset="0x1E0" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_EFTN" offset="0x1E4" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Nanoseconds Register">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="GMAC_EFRSL" offset="0x1E8" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Received Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_EFRN" offset="0x1EC" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Received Nanoseconds Register">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="GMAC_PEFTSL" offset="0x1F0" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_PEFTN" offset="0x1F4" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Nanoseconds Register">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="GMAC_PEFRSL" offset="0x1F8" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_PEFRN" offset="0x1FC" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Nanoseconds Register">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="GMAC_RXLPI" offset="0x270" rw="R" size="4" initval="0x00000000" caption="Received LPI Transitions">
          <bitfield name="COUNT" caption="Count of Received LPI transitions (cleared on read)" mask="0xFFFF"/>
        </register>
        <register name="GMAC_RXLPITIME" offset="0x274" rw="R" size="4" initval="0x00000000" caption="Received LPI Time">
          <bitfield name="LPITIME" caption="Time in LPI (cleared on read)" mask="0xFFFFFF"/>
        </register>
        <register name="GMAC_TXLPI" offset="0x278" rw="R" size="4" initval="0x00000000" caption="Transmit LPI Transitions">
          <bitfield name="COUNT" caption="Count of LPI transitions (cleared on read)" mask="0xFFFF"/>
        </register>
        <register name="GMAC_TXLPITIME" offset="0x27C" rw="R" size="4" initval="0x00000000" caption="Transmit LPI Time">
          <bitfield name="LPITIME" caption="Time in LPI (cleared on read)" mask="0xFFFFFF"/>
        </register>
        <register name="GMAC_ISRPQ" offset="0x400" rw="R" size="4" count="2" initval="0x00000000" caption="Interrupt Status Register Priority Queue (index = 1)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded or Late Collision" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to System Bus Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="HRESP" caption="System Bus Error" mask="0x800"/>
        </register>
        <register name="GMAC_TBQBAPQ" offset="0x440" rw="RW" size="4" count="2" initval="0x00000000" caption="Transmit Buffer Queue Base Address Register Priority Queue (index = 1)">
          <bitfield name="TXBQBA" caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="GMAC_RBQBAPQ" offset="0x480" rw="RW" size="4" count="2" initval="0x00000000" caption="Receive Buffer Queue Base Address Register Priority Queue (index = 1)">
          <bitfield name="RXBQBA" caption="Receive Buffer Queue Base Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="GMAC_RBSRPQ" offset="0x4A0" rw="RW" size="4" count="2" initval="0x00000002" caption="Receive Buffer Size Register Priority Queue (index = 1)">
          <bitfield name="RBS" caption="Receive Buffer Size" mask="0xFF" values="GMAC_RBSRPQ__RBS"/>
        </register>
        <register name="GMAC_CBSCR" offset="0x4BC" rw="RW" size="4" initval="0x00000000" caption="Credit-Based Shaping Control Register">
          <bitfield name="QAE" caption="Queue A CBS Enable" mask="0x1" values="GMAC_CBSCR__QAE"/>
          <bitfield name="QBE" caption="Queue B CBS Enable" mask="0x2" values="GMAC_CBSCR__QBE"/>
        </register>
        <register name="GMAC_CBSISQA" offset="0x4C0" rw="RW" size="4" initval="0x00000000" caption="Credit-Based Shaping IdleSlope Register for Queue A">
          <bitfield name="IS" caption="IdleSlope" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_CBSISQB" offset="0x4C4" rw="RW" size="4" initval="0x00000000" caption="Credit-Based Shaping IdleSlope Register for Queue B">
          <bitfield name="IS" caption="IdleSlope" mask="0xFFFFFFFF"/>
        </register>
