zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
        <register caption="Interrupt Enable Register" name="I2SC_IER" offset="0x14" rw="W" size="4">
          <bitfield caption="Receiver Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Enable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Enable" mask="0x00000040" name="TXUR"/>
        </register>
        <register caption="Interrupt Disable Register" name="I2SC_IDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Disable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Disable" mask="0x00000040" name="TXUR"/>
        </register>
        <register caption="Interrupt Mask Register" name="I2SC_IMR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Disable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Disable" mask="0x00000040" name="TXUR"/>
        </register>
        <register caption="Receiver Holding Register" name="I2SC_RHR" offset="0x20" rw="R" size="4">
          <bitfield caption="Receiver Holding Register" mask="0xFFFFFFFF" name="RHR"/>
        </register>
        <register caption="Transmitter Holding Register" name="I2SC_THR" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmitter Holding Register" mask="0xFFFFFFFF" name="THR"/>
        </register>
      </register-group>
      <value-group caption="Inter-IC Sound Controller Mode" name="I2SC_MR__MODE">
        <value caption="I2SC_CK and I2SC_WS pin inputs used as bit clock and word select/frame synchronization." name="SLAVE" value="0"/>
        <value caption="Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SC_CK and I2SC_WS pins. Peripheral clock or GCLK is output as master clock on I2SC_MCK if I2SC_MR.IMCKMODE is set." name="MASTER" value="1"/>
      </value-group>
      <value-group caption="Data Word Length" name="I2SC_MR__DATALENGTH">
        <value caption="Data length is set to 32 bits" name="_32_BITS" value="0x0"/>
        <value caption="Data length is set to 24 bits" name="_24_BITS" value="0x1"/>
        <value caption="Data length is set to 20 bits" name="_20_BITS" value="0x2"/>
        <value caption="Data length is set to 18 bits" name="_18_BITS" value="0x3"/>
        <value caption="Data length is set to 16 bits" name="_16_BITS" value="0x4"/>
        <value caption="Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word." name="_16_BITS_COMPACT" value="0x5"/>
        <value caption="Data length is set to 8 bits" name="_8_BITS" value="0x6"/>
        <value caption="Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word." name="_8_BITS_COMPACT" value="0x7"/>
      </value-group>
      <value-group caption="Data Format" name="I2SC_MR__FORMAT">
        <value caption="I2S format, stereo with I2SC_WS low for left channel, and MSB of sample starting one I2SC_CK period after I2SC_WS edge" name="I2S" value="0"/>
        <value caption="Left-justified format, stereo with I2SC_WS high for left channel, and MSB of sample starting on I2SC_WS edge" name="LJ" value="1"/>
      </value-group>
      <value-group caption="Master Clock to fs Ratio" name="I2SC_MR__IMCKFS">
        <value caption="Sample frequency ratio set to 32" name="M2SF32" value="0x0"/>
        <value caption="Sample frequency ratio set to 64" name="M2SF64" value="0x1"/>
        <value caption="Sample frequency ratio set to 96" name="M2SF96" value="0x2"/>
        <value caption="Sample frequency ratio set to 128" name="M2SF128" value="0x3"/>
        <value caption="Sample frequency ratio set to 192" name="M2SF192" value="0x5"/>
        <value caption="Sample frequency ratio set to 256" name="M2SF256" value="0x7"/>
        <value caption="Sample frequency ratio set to 384" name="M2SF384" value="0xB"/>
        <value caption="Sample frequency ratio set to 512" name="M2SF512" value="0xF"/>
        <value caption="Sample frequency ratio set to 768" name="M2SF768" value="0x17"/>
        <value caption="Sample frequency ratio set to 1024" name="M2SF1024" value="0x1F"/>
        <value caption="Sample frequency ratio set to 1536" name="M2SF1536" value="0x2F"/>
        <value caption="Sample frequency ratio set to 2048" name="M2SF2048" value="0x3F"/>
      </value-group>
    </module>
    <module name="ICE" caption="In-Circuit Emulator (JTAG/SWD/SWO)"/>
    <module caption="Integrity Check Monitor" id="11105" name="ICM" version="I">
      <register-group name="ICM">
        <register caption="Configuration Register" name="ICM_CFG" offset="0x00" rw="RW" size="4">
          <bitfield caption="Write Back Disable" mask="0x00000001" name="WBDIS"/>
          <bitfield caption="End of Monitoring Disable" mask="0x00000002" name="EOMDIS"/>
          <bitfield caption="Secondary List Branching Disable" mask="0x00000004" name="SLBDIS"/>
          <bitfield caption="Bus Burden Control" mask="0x000000F0" name="BBC"/>
          <bitfield caption="Automatic Switch To Compare Digest" mask="0x00000100" name="ASCD"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000200" name="DUALBUFF"/>
          <bitfield caption="User Initial Hash Value" mask="0x00001000" name="UIHASH"/>
          <bitfield caption="User SHA Algorithm" mask="0x0000E000" name="UALGO" values="ICM_CFG__UALGO"/>
        </register>
        <register caption="Control Register" name="ICM_CTRL" offset="0x04" rw="W" size="4">
          <bitfield caption="ICM Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="ICM Disable Register" mask="0x00000002" name="DISABLE"/>
          <bitfield caption="Software Reset" mask="0x00000004" name="SWRST"/>
          <bitfield caption="Recompute Internal Hash" mask="0x000000F0" name="REHASH"/>
          <bitfield caption="Region Monitoring Disable" mask="0x00000F00" name="RMDIS"/>
          <bitfield caption="Region Monitoring Enable" mask="0x0000F000" name="RMEN"/>
        </register>
