zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
        <register caption="Master Error Status Register" name="MATRIX_MESR" offset="0x015C" rw="R" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
        </register>
        <register caption="Master 0 Error Address Register" count="12" name="MATRIX_MEAR" offset="0x0160" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Write Protection Mode Register" name="MATRIX_WPMR" offset="0x01E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key (Write-only)" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Security Slave 0 Register" count="15" name="MATRIX_SSR" offset="0x0200" rw="RW" size="4">
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000001" name="LANSECH0"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000002" name="LANSECH1"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000004" name="LANSECH2"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000008" name="LANSECH3"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000010" name="LANSECH4"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000020" name="LANSECH5"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000040" name="LANSECH6"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000080" name="LANSECH7"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00000100" name="RDNSECH0"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00000200" name="RDNSECH1"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00000400" name="RDNSECH2"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00000800" name="RDNSECH3"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00001000" name="RDNSECH4"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00002000" name="RDNSECH5"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00004000" name="RDNSECH6"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00008000" name="RDNSECH7"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00010000" name="WRNSECH0"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00020000" name="WRNSECH1"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00040000" name="WRNSECH2"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00080000" name="WRNSECH3"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00100000" name="WRNSECH4"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00200000" name="WRNSECH5"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00400000" name="WRNSECH6"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00800000" name="WRNSECH7"/>
        </register>
        <register caption="Security Areas Split Slave 0 Register" count="15" name="MATRIX_SASSR" offset="0x0240" rw="RW" size="4">
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x0000000F" name="SASPLIT0"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x000000F0" name="SASPLIT1"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x00000F00" name="SASPLIT2"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x0000F000" name="SASPLIT3"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x000F0000" name="SASPLIT4"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x00F00000" name="SASPLIT5"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x0F000000" name="SASPLIT6"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0xF0000000" name="SASPLIT7"/>
        </register>
        <register caption="Security Region Top Client Register" count="15" name="MATRIX_SRTSR" offset="0x0280" rw="RW" size="4">
          <bitfield caption="HSELx Security Region Top" mask="0x0000000F" name="SRTOP0"/>
          <bitfield caption="HSELx Security Region Top" mask="0x000000F0" name="SRTOP1"/>
          <bitfield caption="HSELx Security Region Top" mask="0x00000F00" name="SRTOP2"/>
          <bitfield caption="HSELx Security Region Top" mask="0x0000F000" name="SRTOP3"/>
          <bitfield caption="HSELx Security Region Top" mask="0x000F0000" name="SRTOP4"/>
          <bitfield caption="HSELx Security Region Top" mask="0x00F00000" name="SRTOP5"/>
          <bitfield caption="HSELx Security Region Top" mask="0x0F000000" name="SRTOP6"/>
          <bitfield caption="HSELx Security Region Top" mask="0xF0000000" name="SRTOP7"/>
        </register>
        <register caption="Security Peripheral Select Register" count="3" name="MATRIX_SPSELR" offset="0x02C0" rw="RW" size="4">
          <bitfield caption="Non-secured Peripheral" mask="0x00000001" name="NSECP0"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000002" name="NSECP1"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000004" name="NSECP2"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000008" name="NSECP3"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000010" name="NSECP4"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000020" name="NSECP5"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000040" name="NSECP6"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000080" name="NSECP7"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000100" name="NSECP8"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000200" name="NSECP9"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000400" name="NSECP10"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000800" name="NSECP11"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00001000" name="NSECP12"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00002000" name="NSECP13"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00004000" name="NSECP14"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00008000" name="NSECP15"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00010000" name="NSECP16"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00020000" name="NSECP17"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00040000" name="NSECP18"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00080000" name="NSECP19"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00100000" name="NSECP20"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00200000" name="NSECP21"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00400000" name="NSECP22"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00800000" name="NSECP23"/>
          <bitfield caption="Non-secured Peripheral" mask="0x01000000" name="NSECP24"/>
          <bitfield caption="Non-secured Peripheral" mask="0x02000000" name="NSECP25"/>
          <bitfield caption="Non-secured Peripheral" mask="0x04000000" name="NSECP26"/>
          <bitfield caption="Non-secured Peripheral" mask="0x08000000" name="NSECP27"/>
          <bitfield caption="Non-secured Peripheral" mask="0x10000000" name="NSECP28"/>
          <bitfield caption="Non-secured Peripheral" mask="0x20000000" name="NSECP29"/>
          <bitfield caption="Non-secured Peripheral" mask="0x40000000" name="NSECP30"/>
          <bitfield caption="Non-secured Peripheral" mask="0x80000000" name="NSECP31"/>
        </register>
      </register-group>
      <value-group caption="Undefined Length Burst Type" name="MATRIX_MCFG__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLIMITED" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing rearbitration at each beat of the INCR burst or bursts sequence." name="SINGLE" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing rearbitration every 4 beats." name="_4_BEAT" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing rearbitration every 8 beats." name="_8_BEAT" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing rearbitration every 16 beats." name="_16_BEAT" value="0x4"/>
        <value caption="32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing rearbitration every 32 beats." name="_32_BEAT" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing rearbitration every 64 beats." name="_64_BEAT" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing rearbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving." name="_128_BEAT" value="0x7"/>
      </value-group>
