zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
        <register caption="UHPHS Port Status and Control Register 1" name="UHPHS_PORTSC_1" offset="0x58" rw="RW" size="4">
          <bitfield caption="Current Connect Status (read-only)" mask="0x00000001" name="CCS"/>
          <bitfield caption="Connect Status Change (read/write clear)" mask="0x00000002" name="CSC"/>
          <bitfield caption="Port Enabled/Disabled (read/write)" mask="0x00000004" name="PED"/>
          <bitfield caption="Port Enable/Disable Change (read/write clear)" mask="0x00000008" name="PEDC"/>
          <bitfield caption="Over-current Active (read-only)" mask="0x00000010" name="OCA"/>
          <bitfield caption="Over-current Change (read/write clear)" mask="0x00000020" name="OCC"/>
          <bitfield caption="Force Port Resume (read/write)" mask="0x00000040" name="FPR"/>
          <bitfield caption="Suspend (read/write)" mask="0x00000080" name="SUS"/>
          <bitfield caption="Port Reset (read/write)" mask="0x00000100" name="PR"/>
          <bitfield caption="Line Status (read-only)" mask="0x00000C00" name="LS"/>
          <bitfield caption="Port Power (read/write or read-only)" mask="0x00001000" name="PP"/>
          <bitfield caption="Port Owner (read/write)" mask="0x00002000" name="PO"/>
          <bitfield caption="Port Indicator Control (read/write)" mask="0x0000C000" name="PIC"/>
          <bitfield caption="Port Test Control (read/write)" mask="0x000F0000" name="PTC"/>
          <bitfield caption="Wake on Connect Enable (read/write)" mask="0x00100000" name="WKCNNT_E"/>
          <bitfield caption="Wake on Disconnect Enable (read/write)" mask="0x00200000" name="WKDSCNNT_E"/>
          <bitfield caption="Wake on Over-current Enable (read/write)" mask="0x00400000" name="WKOC_E"/>
        </register>
        <register caption="UHPHS Port Status and Control Register 2" name="UHPHS_PORTSC_2" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Current Connect Status (read-only)" mask="0x00000001" name="CCS"/>
          <bitfield caption="Connect Status Change (read/write clear)" mask="0x00000002" name="CSC"/>
          <bitfield caption="Port Enabled/Disabled (read/write)" mask="0x00000004" name="PED"/>
          <bitfield caption="Port Enable/Disable Change (read/write clear)" mask="0x00000008" name="PEDC"/>
          <bitfield caption="Over-current Active (read-only)" mask="0x00000010" name="OCA"/>
          <bitfield caption="Over-current Change (read/write clear)" mask="0x00000020" name="OCC"/>
          <bitfield caption="Force Port Resume (read/write)" mask="0x00000040" name="FPR"/>
          <bitfield caption="Suspend (read/write)" mask="0x00000080" name="SUS"/>
          <bitfield caption="Port Reset (read/write)" mask="0x00000100" name="PR"/>
          <bitfield caption="Line Status (read-only)" mask="0x00000C00" name="LS"/>
          <bitfield caption="Port Power (read/write or read-only)" mask="0x00001000" name="PP"/>
          <bitfield caption="Port Owner (read/write)" mask="0x00002000" name="PO"/>
          <bitfield caption="Port Indicator Control (read/write)" mask="0x0000C000" name="PIC"/>
          <bitfield caption="Port Test Control (read/write)" mask="0x000F0000" name="PTC"/>
          <bitfield caption="Wake on Connect Enable (read/write)" mask="0x00100000" name="WKCNNT_E"/>
          <bitfield caption="Wake on Disconnect Enable (read/write)" mask="0x00200000" name="WKDSCNNT_E"/>
          <bitfield caption="Wake on Over-current Enable (read/write)" mask="0x00400000" name="WKOC_E"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 06" name="UHPHS_INSNREG06" offset="0xA8" rw="RW" size="4">
          <bitfield caption="Number of Successful Bursts (read-only)(1)" mask="0x0000000F" name="Nb_Success_Burst"/>
          <bitfield caption="Number of Bursts (read-only)(1)" mask="0x000001F0" name="Nb_Burst"/>
          <bitfield caption="Burst Value (read-only)(1)" mask="0x00000E00" name="HBURST"/>
          <bitfield caption="AHB Error" mask="0x80000000" name="AHB_ERR"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 07" name="UHPHS_INSNREG07" offset="0xAC" rw="RW" size="4">
          <bitfield caption="AHB Address (read only)" mask="0xFFFFFFFF" name="AHB_ADDR"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 08" name="UHPHS_INSNREG08" offset="0xB0" rw="RW" size="4">
          <bitfield caption="HSIC Enable/Disable" mask="0x00000004" name="HSIC_EN"/>
        </register>
      </register-group>
    </module>
    <module caption="Watchdog Timer" id="6080" name="WDT" version="N">
      <register-group name="WDT">
        <register caption="Control Register" name="WDT_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Lock Mode Register Write Access" mask="0x00000010" name="LOCKMR"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="WDT_CR__KEY"/>
        </register>
        <register caption="Mode Register" name="WDT_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Watchdog Counter Value" mask="0x00000FFF" name="WDV"/>
          <bitfield caption="Watchdog Fault Interrupt Enable" mask="0x00001000" name="WDFIEN"/>
          <bitfield caption="Watchdog Reset Enable" mask="0x00002000" name="WDRSTEN"/>
          <bitfield caption="Watchdog Disable" mask="0x00008000" name="WDDIS"/>
          <bitfield caption="Watchdog Delta Value" mask="0x0FFF0000" name="WDD"/>
          <bitfield caption="Watchdog Debug Halt" mask="0x10000000" name="WDDBGHLT"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x20000000" name="WDIDLEHLT"/>
        </register>
        <register caption="Status Register" name="WDT_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Watchdog Underflow (cleared on read)" mask="0x00000001" name="WDUNF"/>
          <bitfield caption="Watchdog Error (cleared on read)" mask="0x00000002" name="WDERR"/>
        </register>
      </register-group>
