zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d29/atdf/ATSAMA5D29TA100.atdf
        <register-group caption="Channel Intterupt Enable Register" count="16" name="XDMAC_CHID" name-in-module="XDMAC_CHID" offset="0x50" size="64"/>
      </register-group>
      <value-group caption="Channel x Next Descriptor Enable" name="XDMAC_CNDC__NDE">
        <value caption="Descriptor fetch is disabled." name="DSCR_FETCH_DIS" value="0"/>
        <value caption="Descriptor fetch is enabled." name="DSCR_FETCH_EN" value="1"/>
      </value-group>
      <value-group caption="Channel x Next Descriptor Source Update" name="XDMAC_CNDC__NDSUP">
        <value caption="Source parameters remain unchanged." name="SRC_PARAMS_UNCHANGED" value="0"/>
        <value caption="Source parameters are updated when the descriptor is retrieved." name="SRC_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="Channel x Next Descriptor Destination Update" name="XDMAC_CNDC__NDDUP">
        <value caption="Destination parameters remain unchanged." name="DST_PARAMS_UNCHANGED" value="0"/>
        <value caption="Destination parameters are updated when the descriptor is retrieved." name="DST_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="Channel x Next Descriptor View" name="XDMAC_CNDC__NDVIEW">
        <value caption="Next Descriptor View 0" name="NDV0" value="0x0"/>
        <value caption="Next Descriptor View 1" name="NDV1" value="0x1"/>
        <value caption="Next Descriptor View 2" name="NDV2" value="0x2"/>
        <value caption="Next Descriptor View 3" name="NDV3" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Transfer Type" name="XDMAC_CC__TYPE">
        <value caption="Self-triggered mode (memory-to-memory transfer)." name="MEM_TRAN" value="0"/>
        <value caption="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." name="PER_TRAN" value="1"/>
      </value-group>
      <value-group caption="Channel x Memory Burst Size" name="XDMAC_CC__MBSIZE">
        <value caption="The memory burst size is set to one." name="SINGLE" value="0x0"/>
        <value caption="The memory burst size is set to four." name="FOUR" value="0x1"/>
        <value caption="The memory burst size is set to eight." name="EIGHT" value="0x2"/>
        <value caption="The memory burst size is set to sixteen." name="SIXTEEN" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Synchronization" name="XDMAC_CC__DSYNC">
        <value caption="Peripheral-to-memory transfer." name="PER2MEM" value="0"/>
        <value caption="Memory-to-peripheral transfer." name="MEM2PER" value="1"/>
      </value-group>
      <value-group caption="Channel x Protection" name="XDMAC_CC__PROT">
        <value caption="Channel is secured." name="SEC" value="0"/>
        <value caption="Channel is unsecured." name="UNSEC" value="1"/>
      </value-group>
      <value-group caption="Channel x Software Request Trigger" name="XDMAC_CC__SWREQ">
        <value caption="Hardware request line is connected to the peripheral request line." name="HWR_CONNECTED" value="0"/>
        <value caption="Software request is connected to the peripheral request line." name="SWR_CONNECTED" value="1"/>
      </value-group>
      <value-group caption="Channel x Fill Block of Memory" name="XDMAC_CC__MEMSET">
        <value caption="Memset is not activated." name="NORMAL_MODE" value="0"/>
        <value caption="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." name="HW_MODE" value="1"/>
      </value-group>
      <value-group caption="Channel x Chunk Size" name="XDMAC_CC__CSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="2 data transferred" name="CHK_2" value="0x1"/>
        <value caption="4 data transferred" name="CHK_4" value="0x2"/>
        <value caption="8 data transferred" name="CHK_8" value="0x3"/>
        <value caption="16 data transferred" name="CHK_16" value="0x4"/>
      </value-group>
      <value-group caption="Channel x Data Width" name="XDMAC_CC__DWIDTH">
        <value caption="The data size is set to 8 bits" name="BYTE" value="0x0"/>
        <value caption="The data size is set to 16 bits" name="HALFWORD" value="0x1"/>
        <value caption="The data size is set to 32 bits" name="WORD" value="0x2"/>
        <value caption="The data size is set to 64 bits" name="DWORD" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Source Interface Identifier" name="XDMAC_CC__SIF">
        <value caption="The data is read through the system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is read through the system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="Channel x Destination Interface Identifier" name="XDMAC_CC__DIF">
        <value caption="The data is written through the system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is written though the system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="Channel x Source Addressing Mode" name="XDMAC_CC__SAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Destination Addressing Mode" name="XDMAC_CC__DAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="Channel Initialization Done (this bit is read-only)" name="XDMAC_CC__INITD">
        <value caption="Channel initialization is in progress." name="IN_PROGRESS" value="0"/>
        <value caption="Channel initialization is completed." name="TERMINATED" value="1"/>
      </value-group>
      <value-group caption="Read in Progress (this bit is read-only)" name="XDMAC_CC__RDIP">
        <value caption="No active read transaction on the bus." name="DONE" value="0"/>
        <value caption="A read transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="Write in Progress (this bit is read-only)" name="XDMAC_CC__WRIP">
        <value caption="No active write transaction on the bus." name="DONE" value="0"/>
        <value caption="A write transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__PERID">
        <value caption="TWIHS0_TX" name="THIHS0_TX" value="0"/>
        <value caption="TWIHS0_RX" name="THIHS0_RX" value="1"/>
        <value caption="TWIHS1_TX" name="THIHS1_TX" value="2"/>
        <value caption="TWIHS1_RX" name="THIHS1_RX" value="3"/>
        <value caption="QSPI0_TX" name="QSPI0_TX" value="4"/>
        <value caption="QSPI0_RX" name="QSPI0_RX" value="5"/>
        <value caption="SPI0_TX" name="SPI0_TX" value="6"/>
        <value caption="SPI0_RX" name="SPI0_RX" value="7"/>
        <value caption="SPI1_TX" name="SPI1_TX" value="8"/>
        <value caption="SPI1_RX" name="SPI1_RX" value="9"/>
        <value caption="PWM" name="PWM" value="10"/>
        <value caption="FLEXCOM0_TX" name="FLEXCOM0_TX" value="11"/>
        <value caption="FLEXCOM0_RX" name="FLEXCOM0_RX" value="12"/>
        <value caption="FLEXCOM1_TX" name="FLEXCOM1_TX" value="13"/>
        <value caption="FLEXCOM1_RX" name="FLEXCOM1_RX" value="14"/>
        <value caption="FLEXCOM2_TX" name="FLEXCOM2_TX" value="15"/>
        <value caption="FLEXCOM2_RX" name="FLEXCOM2_RX" value="16"/>
        <value caption="FLEXCOM3_TX" name="FLEXCOM3_TX" value="17"/>
        <value caption="FLEXCOM3_RX" name="FLEXCOM3_RX" value="18"/>
        <value caption="FLEXCOM4_TX" name="FLEXCOM4_TX" value="19"/>
        <value caption="FLEXCOM4_RX" name="FLEXCOM4_RX" value="20"/>
        <value caption="SSC0_TX" name="SSC0_TX" value="21"/>
        <value caption="SSC0_RX" name="SSC0_RX" value="22"/>
        <value caption="SSC1_TX" name="SSC1_TX" value="23"/>
        <value caption="SSC1_RX" name="SSC1_RX" value="24"/>
        <value caption="ADC" name="ADC" value="25"/>
        <value caption="AES_TX" name="AES_TX" value="26"/>
        <value caption="AES_RX" name="AES_RX" value="27"/>
        <value caption="TDES_TX" name="TDES_TX" value="28"/>
        <value caption="TDES_RX" name="TDES_RX" value="29"/>
        <value caption="SHA" name="SHA" value="30"/>
        <value caption="I2SC0_TX" name="I2SC0_TX" value="31"/>
        <value caption="I2SC0_RX" name="I2SC0_RX" value="32"/>
        <value caption="I2SC1_TX" name="I2SC1_TX" value="33"/>
        <value caption="I2SC1_RX" name="I2SC1_RX" value="34"/>
        <value caption="UART0_TX" name="UART0_TX" value="35"/>
        <value caption="UART0_RX" name="UART0_RX" value="36"/>
        <value caption="UART1_TX" name="UART1_TX" value="37"/>
        <value caption="UART1_RX" name="UART1_RX" value="38"/>
        <value caption="UART2_TX" name="UART2_TX" value="39"/>
        <value caption="UART2_RX" name="UART2_RX" value="40"/>
        <value caption="UART3_TX" name="UART3_TX" value="41"/>
        <value caption="UART3_RX" name="UART3_RX" value="42"/>
        <value caption="UART4_TX" name="UART4_TX" value="43"/>
        <value caption="UART4_RX" name="UART4_RX" value="44"/>
        <value caption="TC0" name="TC0" value="45"/>
        <value caption="TC1" name="TC1" value="46"/>
        <value caption="CLASSD" name="CLASSD" value="47"/>
        <value caption="QSPI1_TX" name="QSPI1_TX" value="48"/>
        <value caption="QSPI1_RX" name="QSPI1_RX" value="49"/>
        <value caption="PDMIC" name="PDMIC" value="50"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="BGA324" caption="BGA324">
      <pin position="A14" pad="GND"/>
      <pin position="A1" pad="GND"/>
      <pin position="A3" pad="GND"/>
      <pin position="A7" pad="GND"/>
      <pin position="A10" pad="GND"/>
      <pin position="A13" pad="GND"/>
      <pin position="B12" pad="GND"/>
      <pin position="E12" pad="GND"/>
      <pin position="F9" pad="GND"/>
      <pin position="F15" pad="GND"/>
      <pin position="G18" pad="GND"/>
      <pin position="H13" pad="GND"/>
      <pin position="J4" pad="GND"/>
      <pin position="J7" pad="GND"/>
      <pin position="J10" pad="GND"/>
      <pin position="K9" pad="GND"/>
      <pin position="K18" pad="GND"/>
      <pin position="L18" pad="GND"/>
      <pin position="N5" pad="GND"/>
      <pin position="N9" pad="GND"/>
      <pin position="P18" pad="GND"/>
      <pin position="U1" pad="GND"/>
      <pin position="U13" pad="GND"/>
      <pin position="V1" pad="GND"/>
      <pin position="V14" pad="GND"/>
      <pin position="V18" pad="GND"/>
      <pin position="F5" pad="GND"/>
      <pin position="F6" pad="GND"/>
      <pin position="R14" pad="GND"/>
      <pin position="N14" pad="GND"/>
      <pin position="J9" pad="GND"/>
      <pin position="H3" pad="GND"/>
      <pin position="T11" pad="GND"/>
      <pin position="R8" pad="GND"/>
      <pin position="A18" pad="TA100"/>
      <pin position="C17" pad="TA100"/>
      <pin position="D17" pad="TA100"/>
      <pin position="B13" pad="VDDIODDR"/>
      <pin position="B8" pad="VDDIODDR"/>
      <pin position="B9" pad="VDDIODDR"/>
      <pin position="G17" pad="VDDIODDR"/>
      <pin position="H17" pad="VDDIODDR"/>
      <pin position="M17" pad="VDDIODDR"/>
      <pin position="N17" pad="VDDIODDR"/>
      <pin position="C6" pad="VDDIOP"/>
      <pin position="D6" pad="VDDIOP"/>
      <pin position="E16" pad="TA100"/>
      <pin position="F16" pad="TA100"/>
      <pin position="J3" pad="VDDCORE"/>
      <pin position="P4" pad="VDDCORE"/>
      <pin position="R10" pad="VDDCORE"/>
      <pin position="J16" pad="VDDCORE"/>
      <pin position="N16" pad="VDDCORE"/>
      <pin position="D13" pad="VDDCORE"/>
      <pin position="D8" pad="VDDCORE"/>
      <pin position="E8" pad="VDDCORE"/>
      <pin position="K14" pad="DDR"/>
      <pin position="L14" pad="DDR"/>
      <pin position="E11" pad="DDR"/>
      <pin position="E10" pad="DDR"/>
      <pin position="F14" pad="DDR"/>
      <pin position="L5" pad="GNDANA"/>
      <pin position="M3" pad="GNDANA"/>
      <pin position="M5" pad="VDDANA"/>
      <pin position="L3" pad="VDDANA"/>
      <pin position="R15" pad="VDDIOP"/>
      <pin position="T14" pad="VDDIOP"/>
      <pin position="A2" pad="PB21"/>
      <pin position="A4" pad="PB9"/>
      <pin position="A5" pad="PB6"/>
      <pin position="A6" pad="PB4"/>
      <pin position="A8" pad="DDR"/>
      <pin position="A9" pad="DDR"/>
      <pin position="A11" pad="DDR"/>
      <pin position="A12" pad="DDR"/>
      <pin position="A15" pad="TA100"/>
      <pin position="A16" pad="TA100"/>
      <pin position="A17" pad="TA100"/>
      <pin position="B1" pad="PB25"/>
      <pin position="B2" pad="PB23"/>
      <pin position="B3" pad="PB18"/>
      <pin position="B4" pad="PB13"/>
      <pin position="B5" pad="PB7"/>
      <pin position="B6" pad="PB3"/>
      <pin position="B7" pad="DDR"/>
      <pin position="B10" pad="DDR"/>
      <pin position="B11" pad="DDR"/>
      <pin position="B14" pad="DDR"/>
      <pin position="B15" pad="TA100"/>
      <pin position="B16" pad="TA100"/>
      <pin position="B17" pad="TA100"/>
      <pin position="B18" pad="TA100"/>
      <pin position="C1" pad="PB29"/>
      <pin position="C2" pad="PB28"/>
      <pin position="C3" pad="PB20"/>
      <pin position="C4" pad="PB15"/>
      <pin position="C5" pad="PB11"/>
      <pin position="C7" pad="DDR"/>
      <pin position="C8" pad="DDR"/>
      <pin position="C9" pad="DDR"/>
      <pin position="C10" pad="DDR"/>
      <pin position="C11" pad="DDR"/>
      <pin position="C12" pad="DDR"/>
      <pin position="C13" pad="DDR"/>
      <pin position="C14" pad="DDR"/>
      <pin position="C15" pad="DDR"/>
      <pin position="C16" pad="TA100"/>
      <pin position="C18" pad="TA100"/>
      <pin position="D1" pad="PB31"/>
      <pin position="D2" pad="PB30"/>
      <pin position="D3" pad="PB19"/>
      <pin position="D4" pad="PB17"/>
      <pin position="D5" pad="PB12"/>
      <pin position="D7" pad="DDR"/>
      <pin position="D9" pad="DDR"/>
      <pin position="D10" pad="DDR"/>
      <pin position="D11" pad="DDR"/>
      <pin position="D12" pad="DDR"/>
      <pin position="D14" pad="DDR"/>
      <pin position="D15" pad="DDR"/>
      <pin position="D16" pad="TA100"/>
      <pin position="D18" pad="TA100"/>
      <pin position="E1" pad="PC9"/>
      <pin position="E2" pad="PB27"/>
      <pin position="E3" pad="PB22"/>
      <pin position="E4" pad="PB24"/>
      <pin position="E5" pad="PB16"/>
      <pin position="E6" pad="PB14"/>
      <pin position="E7" pad="PC31"/>
      <pin position="E9" pad="PD1"/>
      <pin position="E13" pad="DDR"/>
      <pin position="E14" pad="DDR"/>
      <pin position="E15" pad="DDR"/>
      <pin position="E17" pad="DDR"/>
      <pin position="E18" pad="TA100"/>
      <pin position="F1" pad="PC12"/>
      <pin position="F2" pad="PC11"/>
      <pin position="F3" pad="PC10"/>
      <pin position="F4" pad="PB26"/>
      <pin position="F7" pad="PB0"/>
      <pin position="F8" pad="PD0"/>
      <pin position="F10" pad="GNDIOP"/>
      <pin position="F11" pad="DDR"/>
      <pin position="F12" pad="DDR"/>
      <pin position="F13" pad="DDR"/>
      <pin position="F17" pad="DDR"/>
      <pin position="F18" pad="DDR"/>
      <pin position="G1" pad="PC17"/>
      <pin position="G2" pad="PC15"/>
      <pin position="G3" pad="PC13"/>
      <pin position="G4" pad="VDDISC"/>
      <pin position="G5" pad="PC14"/>
      <pin position="G6" pad="PB10"/>
      <pin position="G7" pad="PB8"/>
      <pin position="G8" pad="PB1"/>
      <pin position="G9" pad="PC26"/>
      <pin position="G10" pad="PC27"/>
      <pin position="G11" pad="DDR"/>
      <pin position="G12" pad="DDR"/>
      <pin position="G13" pad="DDR"/>
      <pin position="G14" pad="DDR"/>
      <pin position="G15" pad="DDR"/>
      <pin position="G16" pad="DDR"/>
      <pin position="H1" pad="PC21"/>
      <pin position="H2" pad="PC19"/>
      <pin position="H4" pad="PC16"/>
      <pin position="H5" pad="PC18"/>
      <pin position="H6" pad="PC23"/>
      <pin position="H7" pad="PB5"/>
      <pin position="H8" pad="PB2"/>
      <pin position="H9" pad="PC28"/>
      <pin position="H10" pad="PD2"/>
      <pin position="H11" pad="DDR"/>
      <pin position="H12" pad="DDR"/>
      <pin position="H14" pad="DDR"/>
      <pin position="H15" pad="DDR"/>
      <pin position="H16" pad="DDR"/>
      <pin position="H18" pad="DDR"/>
      <pin position="J1" pad="PC24"/>
      <pin position="J2" pad="PC22"/>
      <pin position="J5" pad="PC20"/>
      <pin position="J6" pad="PC25"/>
      <pin position="J8" pad="PC30"/>
      <pin position="J11" pad="DDR"/>
      <pin position="J12" pad="DDR"/>
      <pin position="J13" pad="DDR"/>
      <pin position="J14" pad="DDR"/>
      <pin position="J15" pad="DDR"/>
      <pin position="J17" pad="DDR"/>
      <pin position="J18" pad="DDR"/>
      <pin position="K1" pad="PD8"/>
      <pin position="K2" pad="PD6"/>
      <pin position="K3" pad="PD10"/>
      <pin position="K4" pad="PD5"/>
      <pin position="K5" pad="PD18"/>
      <pin position="K6" pad="PD4"/>
      <pin position="K7" pad="PD7"/>
      <pin position="K8" pad="PC29"/>
      <pin position="K10" pad="DDR"/>
      <pin position="K11" pad="DDR"/>
      <pin position="K12" pad="DDR"/>
      <pin position="K13" pad="DDR"/>
      <pin position="K15" pad="DDR"/>
      <pin position="K16" pad="DDR"/>
      <pin position="L1" pad="PD3"/>
      <pin position="L2" pad="PD17"/>
      <pin position="L4" pad="PD14"/>
      <pin position="L6" pad="PD19"/>
      <pin position="L7" pad="PD15"/>
      <pin position="L8" pad="PD12"/>
      <pin position="L9" pad="PD9"/>
      <pin position="L10" pad="PC3"/>
      <pin position="L11" pad="PC5"/>
      <pin position="L12" pad="PC6"/>
      <pin position="L13" pad="PC8"/>
      <pin position="L15" pad="DDR"/>
      <pin position="L16" pad="DDR"/>
      <pin position="L17" pad="DDR"/>
      <pin position="M1" pad="PD16"/>
      <pin position="M2" pad="PD13"/>
      <pin position="M4" pad="PD22"/>
      <pin position="M6" pad="PD25"/>
      <pin position="M7" pad="PD24"/>
      <pin position="M8" pad="PD27"/>
      <pin position="M9" pad="PD30"/>
      <pin position="M10" pad="PC2"/>
      <pin position="M11" pad="PA14"/>
      <pin position="M12" pad="PC4"/>
      <pin position="M13" pad="PA16"/>
      <pin position="M14" pad="PA17"/>
      <pin position="M15" pad="DDR"/>
      <pin position="M16" pad="DDR"/>
      <pin position="M18" pad="DDR"/>
      <pin position="N1" pad="PD11"/>
      <pin position="N2" pad="PD20"/>
      <pin position="N3" pad="PD23"/>
      <pin position="N4" pad="PD28"/>
      <pin position="N6" pad="ADVREF"/>
      <pin position="N7" pad="PD31"/>
      <pin position="N8" pad="PIOBU7"/>
      <pin position="N10" pad="PA31"/>
      <pin position="N11" pad="PC0"/>
      <pin position="N12" pad="PC1"/>
      <pin position="N13" pad="PA12"/>
      <pin position="N15" pad="DDR"/>
      <pin position="N18" pad="DDR"/>
      <pin position="P1" pad="PD21"/>
      <pin position="P2" pad="PD26"/>
      <pin position="P3" pad="PD29"/>
      <pin position="P5" pad="RXD"/>
      <pin position="P6" pad="GNDBU"/>
      <pin position="P7" pad="VDDBU"/>
      <pin position="P8" pad="PIOBU1"/>
      <pin position="P9" pad="PA1"/>
      <pin position="P10" pad="PA8"/>
      <pin position="P11" pad="PA9"/>
      <pin position="P12" pad="PA28"/>
      <pin position="P13" pad="PA13"/>
      <pin position="P14" pad="VDDFUSE"/>
      <pin position="P15" pad="DDR"/>
      <pin position="P16" pad="DDR"/>
      <pin position="P17" pad="DDR"/>
      <pin position="R1" pad="XOUT32"/>
      <pin position="R2" pad="XIN32"/>
      <pin position="R3" pad="SHDN"/>
      <pin position="R4" pad="WKUP"/>
      <pin position="R5" pad="PIOBU5"/>
      <pin position="R6" pad="PIOBU6"/>
      <pin position="R7" pad="VDDUTMIC"/>
      <pin position="R9" pad="VDDUTMII"/>
      <pin position="R11" pad="VDDSDMMC"/>
      <pin position="R12" pad="PA20"/>
      <pin position="R13" pad="PA26"/>
      <pin position="R16" pad="PA15"/>
      <pin position="R17" pad="PC7"/>
      <pin position="R18" pad="PA11"/>
      <pin position="T1" pad="TST"/>
      <pin position="T2" pad="PIOBU2"/>
      <pin position="T3" pad="PIOBU0"/>
      <pin position="T4" pad="PIOBU4"/>
      <pin position="T5" pad="PIOBU3"/>
      <pin position="T6" pad="GNDDPLL"/>
      <pin position="T7" pad="VDDOSC"/>
      <pin position="T8" pad="VBG"/>
      <pin position="T9" pad="GNDUTMII"/>
      <pin position="T10" pad="PA3"/>
      <pin position="T12" pad="PA6"/>
      <pin position="T13" pad="PA18"/>
      <pin position="T15" pad="PA21"/>
      <pin position="T16" pad="PA23"/>
      <pin position="T17" pad="PA27"/>
      <pin position="T18" pad="PA29"/>
      <pin position="U2" pad="JTAGSEL"/>
      <pin position="U3" pad="NRST"/>
      <pin position="U4" pad="GNDAUDIOPLL"/>
      <pin position="U5" pad="VDDAUDIOPLL"/>
      <pin position="U6" pad="VDDPLLA"/>
      <pin position="U7" pad="GNDOSC"/>
      <pin position="U8" pad="HHSDPA"/>
      <pin position="U9" pad="VDDHSIC"/>
      <pin position="U10" pad="SDCAL"/>
      <pin position="U11" pad="HHSDPDATC"/>
      <pin position="U12" pad="PA2"/>
      <pin position="U14" pad="PA19"/>
      <pin position="U15" pad="PA24"/>
      <pin position="U16" pad="PA25"/>
      <pin position="U17" pad="PA22"/>
      <pin position="U18" pad="PA30"/>
      <pin position="V2" pad="COMPP"/>
      <pin position="V3" pad="COMPN"/>
      <pin position="V4" pad="CLK"/>
      <pin position="V5" pad="GNDPLLA"/>
      <pin position="V6" pad="XOUT"/>
      <pin position="V7" pad="XIN"/>
      <pin position="V8" pad="HHSDMA"/>
      <pin position="V9" pad="HHSDPB"/>
      <pin position="V11" pad="HHSDMSTRC"/>
      <pin position="V12" pad="PA0"/>
      <pin position="V13" pad="PA4"/>
      <pin position="V15" pad="PA5"/>
      <pin position="V16" pad="PA7"/>
      <pin position="V17" pad="PA10"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
